# Subsetting and Descriptive Stats

## Before your start:
   - Remember that you just need to do one of the challenges.
   - Keep in mind that you need to use some of the functions you learned in the previous lessons.
   - All datasets are provided in IronHack's database.
   - Elaborate your codes and outputs as much as you can.
   - Try your best to answer the questions and complete the tasks and most importantly: enjoy the process!
   
#### Import all the necessary libraries here:

In [2]:
# import libraries here
import pandas as pd

# [ONLY ONE MANDATORY] Challenge 1
#### In this challenge we will use the `Temp_States`  dataset. 

#### First import it into a dataframe called `temp`.

In [2]:
# your code here
temp = pd.read_csv('Temp_States.csv')

#### Print `temp`.

In [3]:
# your code here
temp

         City        State  Temperature
0         NYC     New York    19.444444
1      Albany     New York     9.444444
2     Buffalo     New York     3.333333
3    Hartford  Connecticut    17.222222
4  Bridgeport  Connecticut    14.444444
5      Treton   New Jersey    22.222222
6      Newark   New Jersey    20.000000

In [5]:
temp.shape

(7, 3)

#### Explore the data types of the *temp* dataframe. What types of data do we have? Comment your result.

In [4]:
# your code here
temp.dtypes

City            object
State           object
Temperature    float64
dtype: object

In [10]:
temp.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 3 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   City         7 non-null      object
 1   State        7 non-null      object
 2   Temperature  7 non-null      float64
dtypes: float64(1), object(2)
memory usage: 296.0+ bytes

In [ ]:
"""
your comments here

In this dataframe, we have two columns with strings, which combined refer to a location, and one column with floats, 
which show temperature readings at these locations at some given moment. 

"""

#### Select the rows where state is New York.

In [12]:
# your code here

temp[temp["State"] == 'New York']

      City     State  Temperature
0      NYC  New York    19.444444
1   Albany  New York     9.444444
2  Buffalo  New York     3.333333

#### What is the average temperature of cities in New York?

In [15]:
# your code here
temp[temp["State"] == 'New York'].mean()

Temperature    10.740741
dtype: float64

#### Which states and cities have a temperature above 15 degrees Celsius?

In [18]:
# your code here
temp[temp["Temperature"] > 15]

       City        State  Temperature
0       NYC     New York    19.444444
3  Hartford  Connecticut    17.222222
5    Treton   New Jersey    22.222222
6    Newark   New Jersey    20.000000

#### Now, return only the cities that have a temperature above 15 degrees Celsius.

In [23]:
# your code here

temp["City"][(temp["Temperature"] > 15)]

0         NYC
3    Hartford
5      Treton
6      Newark
Name: City, dtype: object

#### Which cities have a temperature above 15 degrees Celcius and below 20 degrees Celsius?

**Hint**: First, write the condition. Then, select the rows.

In [30]:
# your code here
temp[(temp["Temperature"] > 15) & (temp["Temperature"] < 20)]

       City        State  Temperature
0       NYC     New York    19.444444
3  Hartford  Connecticut    17.222222

In [36]:
condition = (temp["Temperature"] > 15) & (temp["Temperature"] < 20)
temp["City"][condition]

0         NYC
3    Hartford
Name: City, dtype: object

#### Find the mean and standard deviation of the temperature of each state.

In [32]:
# your code here
temp.pivot_table(index = ['State'], values= ['Temperature'], aggfunc = ['mean', 'std'])

                   mean         std
            Temperature Temperature
State
Connecticut   15.833333    1.964186
New Jersey    21.111111    1.571348
New York      10.740741    8.133404

In [37]:
temp['Temperature'].groupby(temp['State']).mean()

State
Connecticut    15.833333
New Jersey     21.111111
New York       10.740741
Name: Temperature, dtype: float64

In [38]:
temp['Temperature'].groupby(temp['State']).std()

State
Connecticut    1.964186
New Jersey     1.571348
New York       8.133404
Name: Temperature, dtype: float64

# [ONLY ONE MANDATORY]  Challenge 2

#### Load the `employees` dataset into a dataframe. Call the dataframe `employees`.

In [3]:
# your code here
employees = pd.read_csv('Employee.csv')

In [4]:
employees

     Name Department Education Gender      Title  Years  Salary
0    Jose         IT  Bachelor      M    analyst      1      35
1   Maria         IT    Master      F    analyst      2      30
2   David         HR    Master      M    analyst      2      30
3   Sonia         HR  Bachelor      F    analyst      4      35
4  Samuel      Sales    Master      M  associate      3      55
5     Eva      Sales  Bachelor      F  associate      2      55
6  Carlos         IT    Master      M         VP      8      70
7   Pedro         IT       Phd      M  associate      7      60
8     Ana         HR    Master      F         VP      8      70

In [5]:
employees.shape

(9, 7)

#### Explore the data types of the `employees` dataframe. Comment your results.

In [6]:
# your code here
employees.dtypes

Name          object
Department    object
Education     object
Gender        object
Title         object
Years          int64
Salary         int64
dtype: object

In [7]:
"""
your comments here
The dataframe contains five columns with information on each employee, namely information on their position
at the company (Department, Title), background (Education) and demographic (Gender), as well as their names. All of 
these columns contain strings.
In addition to this, the dataframe contains two columns with information on the employees' tenure at the company
(Years) and their salary (Salary). Both of these columns contain integers.
"""

"\nyour comments here\nThe dataframe contains five columns with information on each employee, namely information on their position\nat the company (Department, Title), background (Education) and demographic (Gender), as well as their names. All of \nthese columns contain strings.\nIn addition to this, the dataframe contains two columns with information on the employees' tenure at the company\n(Years) and their salary (Salary). Both of these columns contain integers.\n"

#### What's the average salary in this company?

In [8]:
# your code here
employees['Salary'].mean()

48.888888888888886

#### What's the highest salary?

In [9]:
# your code here
employees['Salary'].max()

70

#### What's the lowest salary?

In [10]:
# your code here
employees['Salary'].min()

30

#### Who are the employees with the lowest salary?

In [11]:
# your code here
employees["Name"][employees["Salary"] == employees["Salary"].min()]

1    Maria
2    David
Name: Name, dtype: object

#### Find all the information about an employee called David.

In [12]:
# your code here
employees[employees["Name"] == 'David']

    Name Department Education Gender    Title  Years  Salary
2  David         HR    Master      M  analyst      2      30

#### Could you return only David's salary?

In [13]:
# your code here

employees['Salary'][employees["Name"] == 'David']

2    30
Name: Salary, dtype: int64

#### Print all the rows where job title is associate.

In [14]:
# your code here

employees[employees["Title"] == 'analyst']

    Name Department Education Gender    Title  Years  Salary
0   Jose         IT  Bachelor      M  analyst      1      35
1  Maria         IT    Master      F  analyst      2      30
2  David         HR    Master      M  analyst      2      30
3  Sonia         HR  Bachelor      F  analyst      4      35

#### Print the first 3 rows of your dataframe.
**Tip**: There are 2 ways to do it. Do it both ways.

In [15]:
# Method 1
# your code here
employees.head(3)

    Name Department Education Gender    Title  Years  Salary
0   Jose         IT  Bachelor      M  analyst      1      35
1  Maria         IT    Master      F  analyst      2      30
2  David         HR    Master      M  analyst      2      30

In [16]:
# Method 2
# your code here
employees.iloc[:3]

    Name Department Education Gender    Title  Years  Salary
0   Jose         IT  Bachelor      M  analyst      1      35
1  Maria         IT    Master      F  analyst      2      30
2  David         HR    Master      M  analyst      2      30

#### Find the employees whose title is associate and whose salary is above 55.

In [17]:
# your code here
condition = (employees["Title"] == 'associate') & (employees["Salary"] > 65)
employees["Name"][condition]

Series([], Name: Name, dtype: object)

In [18]:
employees[(employees["Title"] == 'associate') & (employees["Salary"] > 65)]

Empty DataFrame
Columns: [Name, Department, Education, Gender, Title, Years, Salary]
Index: []

#### Group the employees by number of years of employment. What are the average salaries in each group?

In [19]:
# your code here
employees['Salary'].groupby(employees['Years']).mean()

Years
1    35.000000
2    38.333333
3    55.000000
4    35.000000
7    60.000000
8    70.000000
Name: Salary, dtype: float64

In [20]:
employees.pivot_table(index = ['Years'], values=['Salary'], aggfunc = ['mean'])

            mean
          Salary
Years
1      35.000000
2      38.333333
3      55.000000
4      35.000000
7      60.000000
8      70.000000

####  What is the average salary per title?

In [21]:
# your code here
employees['Salary'].groupby(employees['Title']).mean()

Title
VP           70.000000
analyst      32.500000
associate    56.666667
Name: Salary, dtype: float64

####  Find the salary quartiles.

In [22]:
# your code here
print(employees['Salary'].quantile(q=0.25))
print(employees['Salary'].quantile(q=0.5))
print(employees['Salary'].quantile(q=0.75))

35.0
55.0
60.0

#### Is the mean salary different per gender?

In [23]:
# your code here
employees['Salary'].groupby(employees['Gender']).mean()

Gender
F    47.5
M    50.0
Name: Salary, dtype: float64

In [26]:
employees.groupby('Gender')['Salary'].mean()

Gender
F    47.5
M    50.0
Name: Salary, dtype: float64

#### Find the minimum, mean and maximum of all numeric columns for each company department.

In [29]:
# your code here
employees.pivot_table(index = ['Department'], values=['Years', 'Salary'], aggfunc = ['min', 'mean', 'max'])

              min         mean              max
           Salary Years Salary     Years Salary Years
Department
HR             30     2  45.00  4.666667     70     8
IT             30     1  48.75  4.500000     70     8
Sales          55     2  55.00  2.500000     55     3

#### Bonus Question:  for each department, compute the difference between the maximum and the minimum salary.
**Hint**: try using `agg` or `apply` combined with `lambda` functions.

In [31]:
# your code here

import numpy as np

employees.pivot_table(index = ['Department'], values=['Salary'], aggfunc = lambda x: np.max(x) - np.min(x))

            Salary
Department
HR              40
IT              40
Sales            0

In [33]:
employees.pivot_table(index = ['Department'], values=['Salary'], aggfunc = ['max', 'min'])

              max    min
           Salary Salary
Department
HR             70     30
IT             70     30
Sales          55     55

# [ONLY ONE MANDATORY] Challenge 3
#### Open the `Orders` dataset. Name your dataset `orders`.

In [ ]:
# your code here

#### Explore your dataset by looking at the data types and summary statistics. Comment your results.

In [ ]:
# your code here

In [ ]:
"""
your comments here
"""

####  What is the average purchase price?

In [ ]:
# your code here

#### What are the highest and lowest purchase prices?

In [ ]:
# your code here

#### Select all the customers from Spain.
**Hint**: Remember that you are not asked to find orders from Spain but customers. A customer might have more than one order associated.

In [ ]:
# your code here

#### How many customers do we have in Spain?

In [ ]:
# your code here

#### Select all the customers who have bought more than 50 items.
**Hint**: Remember that you are not asked to find orders with more than 50 items but customers who bought more than 50 items. A customer with two orders of 30 items each should appear in the selection.

In [ ]:
# your code here

#### Select orders from Spain that include more than 50 items.

In [ ]:
# your code here

#### Select all free orders.

In [ ]:
# your code here

#### Select all orders whose description starts with `lunch bag`.
**Hint**: use string functions.

In [ ]:
# your code here

#### Select all `lunch bag` orders made in 2011.

In [ ]:
# your code here

#### Show the frequency distribution of the amount spent in Spain.

In [ ]:
# your code here

#### Select all orders made in the month of August.

In [ ]:
# your code here

#### Find the number of orders made by each country in the month of August.
**Hint**: Use value_counts().

In [ ]:
# your code here

#### What's the  average amount of money spent by country?

In [ ]:
# your code here

#### What's the most expensive item?

In [ ]:
# your code here

#### What is the average amount spent per year?

In [ ]:
# your code here